app/org/index.org
#+TITLE: Moose App TODO

* Plots
Need to add [[http://shiny.rstudio.com/gallery/][example]] plots for the various plotting libraries.

** [[file:scatterPlot.org][Scatterplots]]

** [[file:barplots.org][Barplots]]

** [[file:maps.org][Maps]]
   
** [[file:3D.org][3D Graphics]]
   
* TODO Documentation [0/7]
  - [ ] pp variables
  - [ ] tp variables
  - [ ] How splitting works
  - [ ] Overview of project (refer to [[https://github.com/ua-snap/shiny-apps/blob/master/plot3D/ui.R][this guy]])
  - [ ] Aggregation: categorical variables
  - [ ] Aggregation: continuous/categorical
  - [ ] Aggregation: cont/cont

* TODO Simple reusable subsetting panel [0/2]
  - [ ] pp
  - [ ] tp

* TODO Create new variables [0/4]
  DEADLINE: <2015-10-30 Fri>
  - [ ] Using R code (arbitrary complexity)
  _For the GUI_
  - [ ] Bin continuous variables
  - [ ] Simple combination variables (multiply/divide etc)
  - [ ] Neighborhood variables

* TODO Models for static charts [0/4]
  - [ ] Simple models: linear, power, exponential
  - [ ] ANOVAs
  - [ ] gompertz
  - [ ] chisq
    
* TODO Tables [1/3]
  *Lowest priority*
  - [ ] Add option to subset by dataTable?  Might be more trouble than it is worth, but would be cool to at least be able \\
    to get summaries of subsets.
  - [ ] googleVis tables - are they any good?
  - [X] formattable looks ok, it uses knitr::kable => decided, "meh"

* TODO Aggregation [1/8]
  DEADLINE: <2015-10-29 Thu>
  - [X] Create UI panel with current variables in subset.
  - [ ] Only allow proper variable types in certain types of aggregation
  - [ ] Implement tables
  - [ ] Do with dplyr
  - [ ] do with data.table (would be nice to have all the options to try)
  - [ ] Allow multiple aggregation functions at once
  - [ ] Add quick access to visual summaries (lines/bars)
  - [ ] Allow access to variables across whole dataset

* TODO Download/Upload [0/4]
  - [ ] save data subsets
  - [ ] save images
  - [ ] upload data
  - [ ] pull data off github
  
* TODO Setup/Maintain [0/2]
  - [ ] setup script
    - [ ] test windows
    - [ ] test linux/mac
  - [ ] batch/shell scripts to run/update app
  
* Packages
  *Graphics packages to explore*:
  + rCharts
  + rcdimple
  + taucharts
  + googleVis
  + dygraphs
  + htmlwidgets
  + plotly
