app/www/org/html/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2015-10-31 Sat 06:20 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title>Moose App TODO</title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Noah Peart" />


 <link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/bigblow/css/htmlize.css"/>
 <link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/bigblow/css/bigblow.css"/>
 <link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/bigblow/css/hideshow.css"/>


</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="sitemap.html"> HOME </a>
</div><div id="content">
<h1 class="title">Moose App TODO</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline5">1. Plots</a>
<ul>
<li><a href="#orgheadline1">1.1. Scatterplots</a></li>
<li><a href="#orgheadline2">1.2. Barplots</a></li>
<li><a href="#orgheadline3">1.3. Maps</a></li>
<li><a href="#orgheadline4">1.4. 3D Graphics</a></li>
</ul>
</li>
<li><a href="#orgheadline6">2. <span class="todo nilTODO">TODO</span> Documentation <code>[0/7]</code></a></li>
<li><a href="#orgheadline7">3. <span class="todo nilTODO">TODO</span> Simple reusable subsetting panel <code>[0/2]</code></a></li>
<li><a href="#orgheadline8">4. <span class="todo nilTODO">TODO</span> Create new variables <code>[0/4]</code></a></li>
<li><a href="#orgheadline9">5. <span class="todo nilTODO">TODO</span> Models for static charts <code>[0/4]</code></a></li>
<li><a href="#orgheadline10">6. <span class="todo nilTODO">TODO</span> Tables <code>[1/3]</code></a></li>
<li><a href="#orgheadline11">7. <span class="todo nilTODO">TODO</span> Aggregation <code>[1/8]</code></a></li>
<li><a href="#orgheadline12">8. <span class="todo nilTODO">TODO</span> Download/Upload <code>[0/4]</code></a></li>
<li><a href="#orgheadline13">9. <span class="todo nilTODO">TODO</span> Setup/Maintain <code>[0/2]</code></a></li>
<li><a href="#orgheadline14">10. Packages</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline5" class="outline-2">
<h2 id="orgheadline5"><span class="section-number-2">1</span> Plots</h2>
<div class="outline-text-2" id="text-1">
<p>
Need to add <a href="http://shiny.rstudio.com/gallery/">example</a> plots for the various plotting libraries.
</p>
</div>

<div id="outline-container-orgheadline1" class="outline-3">
<h3 id="orgheadline1"><span class="section-number-3">1.1</span> <a href="scatterPlot.html">Scatterplots</a></h3>
</div>

<div id="outline-container-orgheadline2" class="outline-3">
<h3 id="orgheadline2"><span class="section-number-3">1.2</span> <a href="barplots.html">Barplots</a></h3>
</div>

<div id="outline-container-orgheadline3" class="outline-3">
<h3 id="orgheadline3"><span class="section-number-3">1.3</span> <a href="maps.html">Maps</a></h3>
</div>

<div id="outline-container-orgheadline4" class="outline-3">
<h3 id="orgheadline4"><span class="section-number-3">1.4</span> <a href="3D.html">3D Graphics</a></h3>
</div>
</div>

<div id="outline-container-orgheadline6" class="outline-2">
<h2 id="orgheadline6"><span class="section-number-2">2</span> <span class="todo TODO">TODO</span> Documentation <code>[0/7]</code></h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> pp variables</li>
<li class="off"><code>[&#xa0;]</code> tp variables</li>
<li class="off"><code>[&#xa0;]</code> How splitting works</li>
<li class="off"><code>[&#xa0;]</code> Overview of project (refer to <a href="https://github.com/ua-snap/shiny-apps/blob/master/plot3D/ui.R">this guy</a>)</li>
<li class="off"><code>[&#xa0;]</code> Aggregation: categorical variables</li>
<li class="off"><code>[&#xa0;]</code> Aggregation: continuous/categorical</li>
<li class="off"><code>[&#xa0;]</code> Aggregation: cont/cont</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline7" class="outline-2">
<h2 id="orgheadline7"><span class="section-number-2">3</span> <span class="todo TODO">TODO</span> Simple reusable subsetting panel <code>[0/2]</code></h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> pp</li>
<li class="off"><code>[&#xa0;]</code> tp</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline8" class="outline-2">
<h2 id="orgheadline8"><span class="section-number-2">4</span> <span class="todo TODO">TODO</span> Create new variables <code>[0/4]</code></h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> Using R code (arbitrary complexity)</li>
</ul>
<p>
<span class="underline">For the GUI</span>
</p>
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> Bin continuous variables</li>
<li class="off"><code>[&#xa0;]</code> Simple combination variables (multiply/divide etc)</li>
<li class="off"><code>[&#xa0;]</code> Neighborhood variables</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline9" class="outline-2">
<h2 id="orgheadline9"><span class="section-number-2">5</span> <span class="todo TODO">TODO</span> Models for static charts <code>[0/4]</code></h2>
<div class="outline-text-2" id="text-5">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> Simple models: linear, power, exponential</li>
<li class="off"><code>[&#xa0;]</code> ANOVAs</li>
<li class="off"><code>[&#xa0;]</code> gompertz</li>
<li class="off"><code>[&#xa0;]</code> chisq</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline10" class="outline-2">
<h2 id="orgheadline10"><span class="section-number-2">6</span> <span class="todo TODO">TODO</span> Tables <code>[1/3]</code></h2>
<div class="outline-text-2" id="text-6">
<p>
<b>Lowest priority</b>
</p>
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> Add option to subset by dataTable?  Might be more trouble than it is worth, but would be cool to at least be able <br  />
to get summaries of subsets.</li>
<li class="off"><code>[&#xa0;]</code> googleVis tables - are they any good?</li>
<li class="on"><code>[X]</code> formattable looks ok, it uses knitr::kable =&gt; decided, "meh"</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline11" class="outline-2">
<h2 id="orgheadline11"><span class="section-number-2">7</span> <span class="todo TODO">TODO</span> Aggregation <code>[1/8]</code></h2>
<div class="outline-text-2" id="text-7">
<ul class="org-ul">
<li class="on"><code>[X]</code> Create UI panel with current variables in subset.</li>
<li class="off"><code>[&#xa0;]</code> Only allow proper variable types in certain types of aggregation</li>
<li class="off"><code>[&#xa0;]</code> Implement tables</li>
<li class="off"><code>[&#xa0;]</code> Do with dplyr</li>
<li class="off"><code>[&#xa0;]</code> do with data.table (would be nice to have all the options to try)</li>
<li class="off"><code>[&#xa0;]</code> Allow multiple aggregation functions at once</li>
<li class="off"><code>[&#xa0;]</code> Add quick access to visual summaries (lines/bars)</li>
<li class="off"><code>[&#xa0;]</code> Allow access to variables across whole dataset</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline12" class="outline-2">
<h2 id="orgheadline12"><span class="section-number-2">8</span> <span class="todo TODO">TODO</span> Download/Upload <code>[0/4]</code></h2>
<div class="outline-text-2" id="text-8">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> save data subsets</li>
<li class="off"><code>[&#xa0;]</code> save images</li>
<li class="off"><code>[&#xa0;]</code> upload data</li>
<li class="off"><code>[&#xa0;]</code> pull data off github</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline13" class="outline-2">
<h2 id="orgheadline13"><span class="section-number-2">9</span> <span class="todo TODO">TODO</span> Setup/Maintain <code>[0/2]</code></h2>
<div class="outline-text-2" id="text-9">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> setup script
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> test windows</li>
<li class="off"><code>[&#xa0;]</code> test linux/mac</li>
</ul></li>
<li class="off"><code>[&#xa0;]</code> batch/shell scripts to run/update app</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline14" class="outline-2">
<h2 id="orgheadline14"><span class="section-number-2">10</span> Packages</h2>
<div class="outline-text-2" id="text-10">
<p>
<b>Graphics packages to explore</b>:
</p>
<ul class="org-ul">
<li>rCharts</li>
<li>rcdimple</li>
<li>taucharts</li>
<li>googleVis</li>
<li>dygraphs</li>
<li>htmlwidgets</li>
<li>plotly</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Noah Peart</p>
<p class="date">Created: 2015-10-31 Sat 06:20</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
